In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data = sns.load_dataset("titanic")

In [3]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
data = data[["survived","pclass","age","fare","sex"]]

In [5]:
a = data["fare"].max()

In [6]:
data["fare"] = data["fare"] - data["fare"].mean()/data["fare"].std()
data.head()

   survived  pclass   age       fare     sex
0         0       3  22.0   6.601942    male
1         1       1  38.0  70.635242  female
2         1       3  26.0   7.276942  female
3         1       1  35.0  52.451942  female
4         0       3  35.0   7.401942    male

In [7]:
data["sex"] = data["sex"].map({"male":1,"female":2})

In [8]:
data.head()

   survived  pclass   age       fare  sex
0         0       3  22.0   6.601942    1
1         1       1  38.0  70.635242    2
2         1       3  26.0   7.276942    2
3         1       1  35.0  52.451942    2
4         0       3  35.0   7.401942    1

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   age       714 non-null    float64
 3   fare      891 non-null    float64
 4   sex       891 non-null    int64
dtypes: float64(2), int64(3)
memory usage: 34.9 KB

In [10]:
data.shape

(891, 5)

In [11]:
data["age"].fillna(data["age"].mean(),inplace = True)
#data.dropna(inplace = True)
print(data.shape)
print(data.info())

(891, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   age       891 non-null    float64
 3   fare      891 non-null    float64
 4   sex       891 non-null    int64
dtypes: float64(2), int64(3)
memory usage: 34.9 KB
None

In [12]:
target = data["survived"]
data = data[["pclass","age","fare","sex"]]

In [13]:
from sklearn.model_selection import train_test_split
from sklearn import tree

In [14]:
 X_train, X_test, y_train, y_test = train_test_split(data,target, train_size = 0.8)

In [15]:
len(X_train)

712

In [16]:
model = tree.DecisionTreeClassifier()

In [17]:
model.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [18]:
predicted = model.predict(X_test)

In [19]:
model.score(X_test,y_test)

0.8156424581005587

In [20]:
from sklearn.metrics import mean_squared_error , r2_score , accuracy_score

In [21]:
mean_squared_error(predicted,y_test )

0.18435754189944134

In [22]:
r2_score(predicted,y_test)

0.24789915966386533

In [23]:
accuracy_score(predicted,y_test)

0.8156424581005587